In [1]:
import  pandas as pd

In [3]:
# birebir birleştirme

In [5]:
df1 = pd.DataFrame({"calisanlar" : ["Ali" ,"Veli" ,"Ayse" ,"Fatma"],
                   "grup" :["Muhasebe" ,"Muhendislik","Muhendislik" ,"IK"]
                   })



df2  = pd.DataFrame({
    "calisanlar" : ["Ali" ,"Veli" ,"Ayse" ,"Fatma"],
    "ilk_giris" : [2010 ,2009 ,2014 ,2019]
    
        
})

In [6]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [7]:
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [10]:
a = pd.merge(df1 ,df2)

In [11]:
a

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [18]:
b = pd.merge(df1 ,df2 ,on ="calisanlar")

In [19]:
b

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

# coktan teke

In [23]:
df3 = pd.merge(df1 ,df2)

In [24]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [25]:
df4 = pd.DataFrame({"grup" : ["Muhasebe" ,"Muhendislik" ,"IK"]
                   ,"mudur" : ["Caner" ,"Mustafa" ,"Berkcan"]
                   
                   })

In [26]:
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [27]:
pd.merge(df3 ,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Muhendislik       2009  Mustafa
2       Ayse  Muhendislik       2014  Mustafa
3      Fatma           IK       2019  Berkcan

In [28]:
# çoktan çoka

In [30]:
df5 = pd.DataFrame({"grup" : ["Muhasebe" ,"Muhasebe" ,"Muhendislik" ,"Muhendislik" ,"IK" ,"IK"]
                   ,"yetenekler" : ["matematik" ,"exel" ,"kodlama" ,"linux" ,"exel" ,"yonetim"]
                   })

In [31]:
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe       exel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK       exel
5           IK    yonetim

In [32]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [36]:
pd.merge(df1 ,df5 )

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe       exel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           IK       exel
7      Fatma           IK    yonetim